'use strict';

/*global angular */

var app = angular.module('app', ['ui.router']);


app.config(function($stateProvider, $urlRouterProvider, $locationProvider) {
    
    $locationProvider.html5Mode(true);

    // For any unmatched url, redirect to /state1
    $urlRouterProvider.otherwise('/');
    //
    // Now set up the states
    $stateProvider
        .state('home', {
            url: '/',
            templateUrl: 'templates/home.html',
            controller : function ($scope, MetaSrv) {
                MetaSrv.title = 'עמוד הבית';

                $scope.page = {
                    title : 'עמוד הבית',
                    content : 'חמה הנדל נולדה כבתם השנייה של ד"ר מיכאל וחנה לבית פוירשטיין. שני הוריה עלו ארצה מפולין, ואביה שימש במשך שנים רבות כמפקח במשרד החינוך. חלק ניכר ממשפחתה נספה בשואה. גדלה בשכונת רחביה בירושלים ושאפה לעסוק במשחק. בין השנים 1956 — 1954 שירתה בלהקת הנח"ל,'
                };
            }
        })
        .state('page1', {
            url: '/חרדות-מגניבות',
            templateUrl: 'templates/contentpage.html',
            controller : function ($scope, MetaSrv) {
                MetaSrv.title = 'חרדות מגניבות';

                $scope.page = {
                    title : 'חרדות מגניבות',
                    content : 'מציאותי, או איום פנימי במחשבותיו של האדם. ישנם אנשים החווים תגובה של חרדה בעת מצבים שהם חווים בחיים – עלייה במעלית, לפני מבחן, כשהם מבחינים בגוק רץ לאורך הבית או בעתות של מתיחות ביטחונית. אחרים חווים חרדה גם ללא אירוע ספציפי המתרחש או עתיד להתרחש, אלא לאור האפשרות שמשהו יתרחש – למשל, פחד שילעגו לאדם בזמן הרצאה או בכל שיחה מול כמה אנשים, פחד מהשפלה, פחד ממחלה ממארת או כל מחלה אחרת בלי הוכחה סבירה לסיכוי שהיא תפרוץ, ועוד. כולנו חווים מדי פעם פחדים מסוימים וכמעט בלתי נמנע לפגוש בהם במהלך חיינו, אלא שחרדה יכולה להוביל גם לפגיעה משמעותית בתפקוד ובאיכות חייו של האדם, בעיקר בגלל ההמנעות. ניתן להגדיר חרדה באמצעות הופעתם של ארבעה , אשר גם הן גורמות באופן ישיר לת ים אנשים חשים מתח לאו דו מיקה יותר ישנו הבדל, הן בהרגשה, בהשפעה על החיים וכמובן בהתמודדות דפיקות לב מואצות'
                };
            }
        })
        .state('page2', {
            url: '/מינוי-לעיתון',
            templateUrl: 'templates/contentpage.html',
            controller : function ($scope, MetaSrv) {
                MetaSrv.title = 'מינוי לעיתון';

                $scope.page = {
                    title : 'מינוי לעיתון',
                    content : 'נחשף, בין היתר משום שהצהרת ההון שלו לא פורסמה ברבים. כץ, שר הרווחה החדש, כיהן עד לאחרונה ובמשך 22 שנה גם כיו”ר ועד העובדים בתעשייה האווירית והוא ידיד קרוב של אנשי העסקים החשאיים המזוהים עם ישראמקו, קובי מימון וחיים צוף. השניים בנו  שף את הצהרת ההון שלו ואת קשריו עם מימון וצוף, נמסר כי “השר כץ יגיש במועד וכמקובל את הצהרת ההון שלו למבקר המדינה. השר הדיר עצמו מכל מגע הקשור בהסדרת הגז בישראל וכל ניסיון לק וא פופוליסטי. השר עסוק בענייני משרדו וכל תשומת ליבו מוקדשת לכך וגורמים אינטרסנטים מבקשים להפריע לפועלו”.'
                };
            }
        })

        .state('page3', {
            url: '/רגעים-שנזכור',
            templateUrl: 'templates/contentpage.html',
            controller : function ($scope, MetaSrv) {
                MetaSrv.title = 'רגעים שנזכור';

                $scope.page = {
                    title : 'רגעים שנזכור ביום שאחרי',
                    content : 'כריסטופר למברט ב"איש הנצח" הקאלטי משנות השמונים, אך בעוד שם העלילה עסקה בקרב על הישרדותו של איש הנצח האחרון, כאן העלילה עוסקת בדבר אחד בלבד: סיפור אהבה. איתו יצוצו שלוש שאלות דרמטיות בחייה של אדליין: האם יכולה הבלתי מזדקנת שלנו להתאהב? האם תרשה לעצמה? האם לראשונה תחשוף את סודותיה? התשובות, בלי יותר מדי ספוילרים, הן כן כן וכן. מעבר לכך, הסרט שומר את הצופה בעמדת ציפייה די דרוכה לבאות, הרבה בזכות עבודת המצלמה המושקעת והמשחק האמין של לייבלי. גם המוזיקה האפקטיבית בפסקול מייצרת תחושה (מעט כוזבת) שמדובר בדרמת מתח ולא בסיפור אהבה די '
                };
            }
        });
});

app.factory('MetaSrv', function () {
    return {
        title : ''
    };
});

app.controller('MetaCtrl', function ($scope, MetaSrv) {
    $scope.MetaSrv = MetaSrv;
});